Revit 2024 API
SpecialType Enumeration
 An enumerated type listing special types that can appear in an ExportLayerTable. These types do not represent an independent category in Revit, but can be mapped to specific layers on export.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum SpecialType
Visual Basic
Public Enumeration SpecialType
Visual C++
public enum class SpecialType
Members
Member name | Description
Default |  The default value for most Revit categories and subcategories.
InteriorWall |  The special type representing interior walls.
ExteriorWall |  The special type representing exterior walls.
FoundationWall |  The special type representing foundation walls.
RetainingWall |  The special type representing retaining walls.
See Also
Autodesk.Revit.DB Namespace